---
kind: method
id: M:Autodesk.Revit.DB.Plumbing.PipingSystem.CanBeHydraulicLoopBoundary(Autodesk.Revit.DB.Element)
source: html/4547afe6-e906-85f1-df6e-a7100eeae62f.htm
---
# Autodesk.Revit.DB.Plumbing.PipingSystem.CanBeHydraulicLoopBoundary Method

Checks if the element can be used as a hydraulic loop boundary.

## Syntax (C#)
```csharp
public static bool CanBeHydraulicLoopBoundary(
	Element element
)
```

## Parameters
- **element** (`Autodesk.Revit.DB.Element`) - The element to be checked.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null